// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const namber = prompt();

// const total = Number(namber) === 10 ? alert("Вірно") : alert("Невірно");

//! task-2//

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min <= 15) {
//   console.log(alert(`${min} входить в першу чверть`));
// } else if (min > 15 && min <= 30) {
//   console.log(alert(`${min} входить в 2 чверть`));
// } else if (min > 30 && min <= 45) {
//   console.log(alert(`${min} входить в 3 чверть`));
// } else {
//   console.log(alert(`${min} входить в 4 чверть`));
// }

//! task-3//

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = prompt();

// let resuit;

// switch (Number(num)) {
//   case 1:
//     console.log("зима");
//     break;
//   case 2:
//     console.log("весна");
//     break;
//   case 3:
//     console.log("зим");
//     break;
//   case 4:
//     console.log("зи");
//     break;
//   default:
//     console.log("Вибачте, але ви маєте ввести значення від 1 до 4 включно");
//     break;
// }

//? task-4//

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

const num = prompt();

const targetLength = num.length;

function leftFillNum(num, targetLength) {
  if (num <= 60) {
    num.padStart(targetLength, "0");
  } else {
    num / 60;
  }
  return num;
}

console.log(num);
